[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant is one of the most resilient indoor plants, perfect for beginners. It can survive in low light and irregular watering conditions. Known for its upright, sword-like leaves, this plant naturally purifies the air by removing toxins such as formaldehyde and benzene. Ideal for bedrooms, offices, or living rooms, it requires minimal care and adds a touch of elegance to any space.",
    "image": "https://media.istockphoto.com/id/1268045137/photo/potted-snake-plants-inside-a-beautiful-new-flat-or-apartment.jpg?s=612x612&w=0&k=20&c=UX79enZ3Rn2jX5labxi_u2Y0s4X3lfOPfr_UG91yego=",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Monstera Deliciosa",
    "category": "Tropical Indoor",
    "price": 35,
    "rating": 4.7,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "Monstera Deliciosa, also known as the Swiss Cheese Plant, is loved for its large glossy leaves with natural holes. It thrives in bright, indirect light and needs watering once a week. With its bold tropical appearance, this plant instantly transforms any interior into a modern jungle. It also improves indoor air quality, making it both stylish and beneficial for your environment.",
    "image": "https://growurban.uk/cdn/shop/articles/care-guide-monstera-deliciosa-668092_680bbf00-9564-4f0c-b9cb-27ededaf19d2.jpg?v=1748436514&width=2048",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 3,
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": 15,
    "rating": 4.6,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "Aloe Vera is a low-maintenance succulent known for its healing gel. It prefers bright light and minimal watering, making it ideal for busy plant owners. The plant’s thick, fleshy leaves store water, helping it survive dry conditions. Beyond its beauty, Aloe Vera helps purify the air and can be used for soothing burns and improving skin health naturally.",
    "image": "https://www.almanac.com/sites/default/files/users/Almanac%20Staff/aloe-vera-cgdeaw_ss_full_width.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 4,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 12,
    "rating": 4.5,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "The Spider Plant is a fast-growing, adaptable indoor favorite. Its arching green and white striped leaves make it visually appealing in hanging pots or tabletop planters. It thrives in moderate light and needs watering once a week. This hardy plant removes carbon monoxide and formaldehyde from the air, making it an excellent choice for improving indoor air quality effortlessly.",
    "image": "https://www.bhg.com/thmb/oDnjlrHprd67aYvinrMfQgVUPtQ=/5332x0/filters:no_upscale():strip_icc()/BHG-spider-plant-c0e0fdd5ec6e4c1588998ce3167f6579.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 5,
    "plantName": "Peace Lily",
    "category": "Flowering Indoor",
    "price": 25,
    "rating": 4.9,
    "availableStock": 9,
    "careLevel": "Medium",
    "description": "Peace Lily is a graceful indoor plant with lush green leaves and white blooms that add beauty to any space. It thrives in low to medium light and needs weekly watering. Besides its stunning looks, it helps purify indoor air by removing toxins like ammonia and formaldehyde. Perfect for living rooms and offices, it brings peace and freshness to your surroundings.",
    "image": "https://casadeamor.in/cdn/shop/articles/79425404.webp?v=1650096756",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 6,
    "plantName": "Pothos (Devil’s Ivy)",
    "category": "Vine Plant",
    "price": 14,
    "rating": 4.4,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "Pothos, also known as Devil’s Ivy, is a popular trailing plant perfect for shelves and hanging planters. It thrives in low to bright light and grows quickly even with minimal care. Its heart-shaped leaves create a relaxing green vibe. This plant is known for filtering toxins from the air and is one of the easiest plants to propagate for new growth.",
    "image": "https://www.gardenia.net/wp-content/uploads/2024/02/shutterstock_2245950515.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 7,
    "plantName": "Rubber Plant",
    "category": "Indoor Tree",
    "price": 40,
    "rating": 4.7,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "The Rubber Plant is a bold statement plant with glossy, deep-green leaves. It prefers bright, indirect light and moderate watering. Known for its air-purifying qualities, this plant adds a modern touch to any interior. It can grow tall over time, making it perfect for living rooms and corners that need a strong visual focus while keeping the environment fresh and vibrant.",
    "image": "https://nurserylive.com/cdn/shop/products/nurserylive-g-plants-rubber-tree-rubber-plant-ficus-elastica-plant.jpg?v=1680766173",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 8,
    "plantName": "ZZ Plant",
    "category": "Low Light",
    "price": 22,
    "rating": 4.6,
    "availableStock": 13,
    "careLevel": "Easy",
    "description": "The ZZ Plant is famous for surviving low-light conditions and neglect. Its waxy, dark-green leaves reflect light beautifully and require watering only once every two to three weeks. Perfect for bedrooms or offices, it adds a sophisticated look while improving air quality. It’s an ideal choice for beginners or anyone with a busy schedule who still loves greenery.",
    "image": "https://assets.architecturaldigest.in/photos/67c5563e486427e6899bce1e/16:9/w_1616,h_909,c_limit/Untitled%20design%202.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 9,
    "plantName": "Chinese Evergreen",
    "category": "Indoor Decorative",
    "price": 28,
    "rating": 4.3,
    "availableStock": 11,
    "careLevel": "Medium",
    "description": "Chinese Evergreen is an elegant plant with colorful, patterned leaves ranging from green to pink and red. It thrives in low to moderate light and tolerates occasional watering mistakes. This plant not only enhances indoor decor but also purifies the air effectively. It’s a great addition to homes or offices seeking vibrant greenery with minimal maintenance needs.",
    "image": "https://images.immediate.co.uk/production/volatile/sites/10/2022/08/2048x1365-Aglaonema-SEO-GettyImages-1308559798-eb73c80.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 10,
    "plantName": "Areca Palm",
    "category": "Tropical Indoor",
    "price": 38,
    "rating": 4.8,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Areca Palm is a lush, tropical plant that brings a vacation vibe indoors. It grows best in bright, indirect light and requires watering twice a week. Its long, feathery fronds improve humidity and purify the air naturally. This plant is ideal for spacious rooms and offices, adding a refreshing green presence and helping reduce stress levels.",
    "image": "https://nurserylive.com/cdn/shop/files/areca.jpg?v=1751753779",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 11,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 20,
    "rating": 4.4,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "Jade Plant, also known as the Money Plant, symbolizes good luck and prosperity. It thrives in bright light and needs minimal watering. Its thick, glossy leaves store water, making it a resilient plant for beginners. With proper care, it can live for years and grow into a small tree. Perfect for desks, windowsills, and modern interiors.",
    "image": "https://hips.hearstapps.com/hmg-prod/images/jade-plant-1-645157c445e14.jpg?crop=1.00xw:0.829xh;0,0&resize=1200:*",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 12,
    "plantName": "Boston Fern",
    "category": "Hanging Plant",
    "price": 24,
    "rating": 4.2,
    "availableStock": 12,
    "careLevel": "Medium",
    "description": "Boston Fern is a classic indoor plant known for its soft, arching fronds. It thrives in humid environments with indirect light and regular misting. This plant not only adds lush greenery but also helps regulate humidity and clean indoor air. It’s perfect for bathrooms, shaded balconies, or hanging baskets, giving your space a fresh, natural look.",
    "image": "https://png.pngtree.com/thumb_back/fh260/background/20250226/pngtree-lush-boston-fern-in-a-hanging-macrame-basket-image_16968187.jpg",
    "providerName": "UrbanGreen Studio"
  }
]
